import { Bot, webhookCallback} from "grammy";

// Створюємо екземпляр класу `Bot` і передаємо йому свій токен бота.
const bot = new Bot("7485330945:AAEiOKQr5c3wg7kpY17tCR2C5eyw5dm9vR4"); // <-- Помістіть токен свого бота між ""

// Тепер можемо зареєструвати обробників для обʼєкта `bot`.
// grammY викликатиме обробники, коли користувачі надсилатимуть повідомлення боту.

// Обробляємо команду /start.
bot.command("start", (ctx) => ctx.reply("Ласкаво просимо! Бот запущений."));
// Обробляємо інші повідомлення.
bot.on("message", (ctx) => ctx.reply("Отримав ще одне повідомлення!"));

// Тепер, коли ми вказали, як обробляти повідомлення, ми можете запустити свого бота.
// Це призведе до підключення до серверів Telegram і очікування повідомлень.

// Запускаємо бота.
bot.start();

export default webhookCallback(bot, "std/http");